In [1]:
# import pandas
import pandas as pd
import sqlite3

In [3]:
# insatll the i-python-sql library
!pip install ipython-sql
# "!" used to check if it is already installed so it ignores that install command otherwise installs .

Requirement already satisfied: ipython-sql in c:\users\achyut sharma\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: six in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython-sql) (3.8.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython-sql) (2.0.19)
Requirement already satisfied: ipython in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: sqlparse in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: ipython-genutils in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\achyut sharma\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.3.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\achyut sharma\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pickleshare in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: setuptools>=18.5 in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (63.4.1)
Requirement already satisfied: decorator in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: colorama in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.5)
Requirement already satisfied: backcall in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pygments in c:\users\achyut sharma\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: wcwidth in c:\users\achyut sharma\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\achyut sharma\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)

In [13]:
# creating a schema.
df = pd.DataFrame ({"name":["Priya","ram","Arzoo","Mary"],
                   "age":[23,25,29,24],
                   "city":["Ahmedabad","Gandhinagar","Surat","Vadodara"]})

# "DataFrame" is used to create a database inside it without it's name.

In [20]:
df

    name  age         city
0  Priya   23    Ahmedabad
1    ram   25  Gandhinagar
2  Arzoo   29        Surat
3   Mary   24     Vadodara

In [21]:
# we will sqlite3 library and now we can create a connection and name the database.
cnn = sqlite3.connect('jupyter_sql_lecture_1_25_July.db')

In [24]:
# here above it shows the count of attributes of table (values of table).

In [23]:
# now we can give name of the table that we created previously and 
df.to_sql('Students',cnn)

4

In [25]:
#load the sql module to ipython-magic module
%load_ext sql

In [26]:
## calling the database my this method.
%sql sqlite:///jupyter_sql_lecture_1_25_July.db

In [28]:
## Here "%%" is used to get or use the Table in Sql.

In [27]:
%%sql 

SELECT * FROM Students

 * sqlite:///jupyter_sql_lecture_1_25_July.db
Done.

[(0, 'Priya', 23, 'Ahmedabad'),
 (1, 'ram', 25, 'Gandhinagar'),
 (2, 'Arzoo', 29, 'Surat'),
 (3, 'Mary', 24, 'Vadodara')]

In [29]:
%%sql

SELECT * FROM Students WHERE name = "Priya"

 * sqlite:///jupyter_sql_lecture_1_25_July.db
Done.

[(0, 'Priya', 23, 'Ahmedabad')]

In [1]:
##THE END FOR TODAY.